EDT/УТ/src/Documents/УчетОборудования/УчетОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчетОборудования</name>
  <registerRecords>InformationRegister.УчетОборудования</registerRecords>
  <registerRecords>AccumulationRegister.УчетОстатковОборудования</registerRecords>
  <registerRecords>InformationRegister.КомплектыОборудования</registerRecords>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеОборудования</name>
    <type>
      <types>EnumRef.СостоянияЕдиницыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>НаемныйЭкипаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыдачаНаДлительныйСрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОборудования</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВводаДанных</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортКомплекта</name>
      <type>
        <types>CatalogRef.новаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановитьКомплектным</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбрудованиеПовреждено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПовреждения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТекущийКомплектОборудования</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/ПривязкаМашинКРейсам/ПривязкаМашинКРейсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПривязкаМашинКРейсам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>ОтвязанВодитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтвязанЭкспедитор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КтоПривязал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяПривязка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/КомплектыОборудования/КомплектыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомплектыОборудования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </resources>
  <resources>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыОборудования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ОперативноеНазначениеТАНаРейс/ОперативноеНазначениеТАНаРейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОперативноеНазначениеТАНаРейс</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТА</name>
    <type>
      <types>CatalogRef.ТелефонныеАппараты</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ТелефонныеАппаратыТранспорта/ТелефонныеАппаратыТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелефонныеАппаратыТранспорта</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТА</name>
    <type>
      <types>CatalogRef.ТелефонныеАппараты</types>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/УчетОборудования/УчетОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетОборудования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеЕдиницыОборудования</name>
    <type>
      <types>EnumRef.СостоянияЕдиницыОборудования</types>
    </type>
  </resources>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </resources>
  <resources>
    <name>ОборудованиеПовреждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыдачаНаДлительныйСрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ТипыОборудования/ТипыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОборудования</name>
  <enumValues>
    <name>ПринтерЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>Смартфон</name>
  </enumValues>
  <enumValues>
    <name>Планшет</name>
  </enumValues>
  <enumValues>
    <name>ТерминалПриемаОплатыПоКарте</name>
  </enumValues>
  <enumValues>
    <name>SIMКарта</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/СостоянияЕдиницыОборудования/СостоянияЕдиницыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЕдиницыОборудования</name>
  <enumValues>
    <name>Выдано</name>
  </enumValues>
  <enumValues>
    <name>Сдано</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/новаТранспорт/новаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаТранспорт</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВнешняяМаршрутизация</name>
      <description>Внешняя маршрутизация</description>
    </items>
  </predefined>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.новаВидыТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.новаМаркиТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГосударственнойРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоподъемность</name>
    <comment>В тоннах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаКузова</name>
    <comment>В метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаКузова</name>
    <comment>В метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаКузова</name>
    <comment>В метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКузова</name>
    <comment>В кубических метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГаражныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнаяВысотаКузова</name>
    <comment>В метрах (используется для ограничений прохождения по улицам)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.новаСклады</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбранныхКатегорий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбранныхРайонов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вместимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойВодитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойГараж</name>
    <type>
      <types>CatalogRef.новаГаражи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКузова</name>
    <type>
      <types>CatalogRef.новаТипыКузовов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗагрузки</name>
    <type>
      <types>CatalogRef.новаСпособыЗагрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>Пропуск</name>
    <type>
      <types>CatalogRef.новаТипыПропусков</types>
    </type>
  </attributes>
  <attributes>
    <name>Лифт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Манипулятор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СанитарныйПаспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонСтоянки</name>
    <type>
      <types>CatalogRef.новаГеоРайоны</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБак</name>
    <type>
      <types>CatalogRef.новаБакиТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныеНормы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобственныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорииТранспортаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>90</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаёмныйТранспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БезМобильногоПриложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТранспорта</name>
    <type>
      <types>CatalogRef.ТипыТранспортаДляЛогистики</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗаКилометр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяСкорость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КатегорииТранспорта</name>
    <attributes>
      <name>ЗначениеКатегории</name>
      <type>
        <types>CatalogRef.новаЗначенияКатегорийТранспорта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Районы</name>
    <attributes>
      <name>Район</name>
      <type>
        <types>CatalogRef.новаГеоРайоны</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Documents/УчетОборудования/ManagerModule.bsl
//CeHbKA #4417 13.01.2020
Функция ПолучитьОтчетЖурналВыдачиОборудования(ДатаРейса, ТерминалДоставки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокРейс.Ссылка КАК Рейс,
		|	ДокРейс.ДатаРейса КАК ДатаРейса,
		|	ДокРейс.ТерминалДоставки КАК ТерминалДоставки,
		|	ЕСТЬNULL(ПривязкаМашинКРейсамСрезПоследних.Транспорт, ЗНАЧЕНИЕ(Справочник.новаТранспорт.ПустаяСсылка)) КАК Транспорт,
		|	ЕСТЬNULL(ПривязкаМашинКРейсамСрезПоследних.Водитель, ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)) КАК Водитель,
		|	ЕСТЬNULL(ПривязкаМашинКРейсамСрезПоследних.Экспедитор, ЗНАЧЕНИЕ(Справочник.новаЭкспедиторы.ПустаяСсылка)) КАК Экспедитор,
		|	ЕСТЬNULL(КомплектыОборудования_Смартфон.Оборудование, ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)) КАК Комплект_Смартфон,
		|	ЕСТЬNULL(КомплектыОборудования_Принтер.Оборудование, ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)) КАК Комплект_Принтер,
		|	ЕСТЬNULL(КомплектыОборудования_Терминал.Оборудование, ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)) КАК Комплект_Терминал
		|ПОМЕСТИТЬ ВТ_1
		|ИЗ
		|	Документ.Рейс КАК ДокРейс
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
		|		ПО (ПривязкаМашинКРейсамСрезПоследних.Рейс = ДокРейс.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КомплектыОборудования.СрезПоследних КАК КомплектыОборудования_Смартфон
		|		ПО (ПривязкаМашинКРейсамСрезПоследних.Транспорт = КомплектыОборудования_Смартфон.Транспорт)
		|			И (КомплектыОборудования_Смартфон.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыОборудования.Смартфон))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КомплектыОборудования.СрезПоследних КАК КомплектыОборудования_Принтер
		|		ПО (ПривязкаМашинКРейсамСрезПоследних.Транспорт = КомплектыОборудования_Принтер.Транспорт)
		|			И (КомплектыОборудования_Принтер.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыОборудования.ПринтерЭтикеток))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КомплектыОборудования.СрезПоследних КАК КомплектыОборудования_Терминал
		|		ПО (ПривязкаМашинКРейсамСрезПоследних.Транспорт = КомплектыОборудования_Терминал.Транспорт)
		|			И (КомплектыОборудования_Терминал.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыОборудования.ТерминалПриемаОплатыПоКарте))
		|ГДЕ
		|	ДокРейс.Проведен
		|	И ДокРейс.ТерминалДоставки = &ТерминалДоставки
		|	И ДокРейс.ДатаРейса = &ДатаРейса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_1.Рейс КАК Рейс,
		|	ВТ_1.ДатаРейса КАК ДатаРейса,
		|	ВТ_1.ТерминалДоставки КАК ТерминалДоставки,
		|	ВТ_1.Транспорт КАК Транспорт,
		|	ВТ_1.Транспорт.Родитель КАК ТипЭкипажа,
		|	ВТ_1.Водитель КАК Водитель,
		|	ЕСТЬNULL(БэйджиСотрудников.КодСотрудника, """") КАК БэйджВодителя,
		|	ВТ_1.Экспедитор КАК Экспедитор,
		|	ВТ_1.Комплект_Смартфон КАК Комплект_Смартфон,
		|	ВТ_1.Комплект_Принтер КАК Комплект_Принтер,
		|	ВТ_1.Комплект_Терминал КАК Комплект_Терминал,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОперативноеНазначениеТАНаРейсСрезПоследних.ТА, ЗНАЧЕНИЕ(Справочник.ТелефонныеАппараты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ТелефонныеАппараты.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(ТелефонныеАппаратыТранспортаСрезПоследних.ТА, ЗНАЧЕНИЕ(Справочник.ТелефонныеАппараты.ПустаяСсылка))
		|		ИНАЧЕ ЕСТЬNULL(ОперативноеНазначениеТАНаРейсСрезПоследних.ТА, ЗНАЧЕНИЕ(Справочник.ТелефонныеАппараты.ПустаяСсылка))
		|	КОНЕЦ КАК Телефон
		|ПОМЕСТИТЬ ВТ_2
		|ИЗ
		|	ВТ_1 КАК ВТ_1
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БэйджиСотрудников КАК БэйджиСотрудников
		|		ПО ВТ_1.Водитель = БэйджиСотрудников.Владелец
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперативноеНазначениеТАНаРейс.СрезПоследних(
		|				,
		|				Рейс В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_1.Рейс
		|					ИЗ
		|						ВТ_1 КАК ВТ_1)) КАК ОперативноеНазначениеТАНаРейсСрезПоследних
		|		ПО ВТ_1.Рейс = ОперативноеНазначениеТАНаРейсСрезПоследних.Рейс
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелефонныеАппаратыТранспорта.СрезПоследних(
		|				,
		|				Транспорт В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_1.Транспорт
		|					ИЗ
		|						ВТ_1 КАК ВТ_1)) КАК ТелефонныеАппаратыТранспортаСрезПоследних
		|		ПО ВТ_1.Транспорт = ТелефонныеАппаратыТранспортаСрезПоследних.Транспорт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_2.Рейс КАК Рейс,
		|	ВТ_2.ДатаРейса КАК ДатаРейса,
		|	ВТ_2.ТерминалДоставки КАК ТерминалДоставки,
		|	ВТ_2.Транспорт КАК Транспорт,
		|	ВТ_2.ТипЭкипажа КАК ТипЭкипажа,
		|	ВТ_2.Водитель КАК Водитель,
		|	ВТ_2.БэйджВодителя КАК БэйджВодителя,
		|	ВТ_2.Экспедитор КАК Экспедитор,
		|	ВТ_2.Комплект_Смартфон КАК Комплект_Смартфон,
		|	ВТ_2.Комплект_Принтер КАК Комплект_Принтер,
		|	ВТ_2.Комплект_Терминал КАК Комплект_Терминал,
		|	ВТ_2.Телефон КАК Телефон,
		|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Смартфон.Оборудование, ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)) КАК Оборудование_Смартфон,
		|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Смартфон.СостояниеЕдиницыОборудования, ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.ПустаяСсылка)) КАК Состояние_Смартфон,
		|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Смартфон.ОборудованиеПовреждено, ЛОЖЬ) КАК Смартфон_Поврежден,
		|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Принтер.Оборудование, ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)) КАК Оборудование_Принтер,
		|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Принтер.СостояниеЕдиницыОборудования, ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.ПустаяСсылка)) КАК Состояние_Принтер,
		|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Принтер.ОборудованиеПовреждено, ЛОЖЬ) КАК Принтер_Поврежден,
		|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Терминал.Оборудование, ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)) КАК Оборудование_Терминал,
		|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Терминал.СостояниеЕдиницыОборудования, ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.ПустаяСсылка)) КАК Состояние_Терминал,
		|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Терминал.ОборудованиеПовреждено, ЛОЖЬ) КАК Терминал_Поврежден,
		|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Принтер.ФизЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ФизЛицо_Принтер,
		|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Смартфон.ФизЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.Пустаяссылка)) КАК ФизЛицо_Смартфон,
		|	ЕСТЬNULL(УчетОборудованияСрезПоследних_Терминал.ФизЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.пустаяСсылка)) КАК ФизЛицо_Терминал,
		|	УчетОборудованияСрезПоследних_Принтер.Период КАК ВремяВыдычи_Принтер,
		|	УчетОборудованияСрезПоследних_Смартфон.Период КАК ВремяВыдычи_Смартфон,
		|	УчетОборудованияСрезПоследних_Терминал.Период КАК ВремяВыдычи_Терминал
		|ПОМЕСТИТЬ ВТ_3
		|ИЗ
		|	ВТ_2 КАК ВТ_2
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОборудования.СрезПоследних(
		|				,
		|				(Оборудование.МодельОборудования.ТипОборудования, Рейс) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ЗНАЧЕНИЕ(Перечисление.ТипыОборудования.Смартфон),
		|						ВТ_2.Рейс КАК Рейс
		|					ИЗ
		|						ВТ_2 КАК ВТ_2)) КАК УчетОборудованияСрезПоследних_Смартфон
		|		ПО ВТ_2.Рейс = УчетОборудованияСрезПоследних_Смартфон.Рейс
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОборудования.СрезПоследних(
		|				,
		|				(Оборудование.МодельОборудования.ТипОборудования, Рейс) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ЗНАЧЕНИЕ(Перечисление.ТипыОборудования.ПринтерЭтикеток),
		|						ВТ_2.Рейс КАК Рейс
		|					ИЗ
		|						ВТ_2 КАК ВТ_2)) КАК УчетОборудованияСрезПоследних_Принтер
		|		ПО ВТ_2.Рейс = УчетОборудованияСрезПоследних_Принтер.Рейс
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОборудования.СрезПоследних(
		|				,
		|				(Оборудование.МодельОборудования.ТипОборудования, Рейс) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ЗНАЧЕНИЕ(Перечисление.ТипыОборудования.ТерминалПриемаОплатыПоКарте),
		|						ВТ_2.Рейс КАК Рейс
		|					ИЗ
		|						ВТ_2 КАК ВТ_2)) КАК УчетОборудованияСрезПоследних_Терминал
		|		ПО ВТ_2.Рейс = УчетОборудованияСрезПоследних_Терминал.Рейс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_3.Рейс КАК Рейс,
		|	ВТ_3.ДатаРейса КАК ДатаРейса,
		|	ВТ_3.ТерминалДоставки КАК ТерминалДоставки,
		|	ВТ_3.Транспорт КАК Транспорт,
		|	ВТ_3.ТипЭкипажа КАК ТипЭкипажа,
		|	ВТ_3.Водитель КАК Водитель,
		|	ВТ_3.БэйджВодителя КАК БэйджВодителя,
		|	ВТ_3.Экспедитор КАК Экспедитор,
		|	ВТ_3.Комплект_Смартфон КАК Комплект_Смартфон,
		|	ВТ_3.Комплект_Принтер КАК Комплект_Принтер,
		|	ВТ_3.Комплект_Терминал КАК Комплект_Терминал,
		|	ВТ_3.Телефон КАК Телефон,
		|	ВЫБОР
		|		КОГДА ВТ_3.Состояние_Смартфон = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано)
		|			ТОГДА ВТ_3.Оборудование_Смартфон
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)
		|	КОНЕЦ КАК Смартфон_Получено,
		|	ВЫБОР
		|		КОГДА ВТ_3.Состояние_Смартфон = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Сдано)
		|			ТОГДА ВТ_3.Оборудование_Смартфон
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)
		|	КОНЕЦ КАК Смартфон_Сдано,
		|	ВЫБОР
		|		КОГДА ВТ_3.Состояние_Принтер = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано)
		|			ТОГДА ВТ_3.Оборудование_Принтер
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)
		|	КОНЕЦ КАК Принтер_Получено,
		|	ВЫБОР
		|		КОГДА ВТ_3.Состояние_Принтер = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Сдано)
		|			ТОГДА ВТ_3.Оборудование_Принтер
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)
		|	КОНЕЦ КАК Принтер_Сдано,
		|	ВЫБОР
		|		КОГДА ВТ_3.Состояние_Терминал = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано)
		|			ТОГДА ВТ_3.Оборудование_Терминал
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)
		|	КОНЕЦ КАК Терминал_Получено,
		|	ВЫБОР
		|		КОГДА ВТ_3.Состояние_Терминал = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Сдано)
		|			ТОГДА ВТ_3.Оборудование_Терминал
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)
		|	КОНЕЦ КАК Терминал_Сдано,
		|	ВТ_3.Смартфон_Поврежден КАК Смартфон_Поврежден,
		|	ВТ_3.Терминал_Поврежден КАК Терминал_Поврежден,
		|	ВТ_3.Принтер_Поврежден КАК Принтер_Поврежден,
		|	ВТ_3.Оборудование_Смартфон КАК Смартфон_Оборудование,
		|	ВТ_3.Состояние_Смартфон КАК Смартфон_Состояние,
		|	ВТ_3.Оборудование_Принтер КАК Принтер_Оборудование,
		|	ВТ_3.Состояние_Принтер КАК Принтер_Состояние,
		|	ВТ_3.Оборудование_Терминал КАК Терминал_Оборудование,
		|	ВТ_3.Состояние_Терминал КАК Терминал_Состояние,
		|	ВЫБОР
		|		КОГДА ВТ_3.Состояние_Принтер = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано)
		|			ТОГДА ВТ_3.ФизЛицо_Принтер
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|	КОНЕЦ КАК ФизЛицо_Принтер,
		|	ВЫБОР
		|		КОГДА ВТ_3.Состояние_Смартфон = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано)
		|			ТОГДА ВТ_3.ФизЛицо_Смартфон
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|	КОНЕЦ КАК ФизЛицо_Смартфон,
		|	ВЫБОР
		|		КОГДА ВТ_3.Состояние_Терминал = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано)
		|			ТОГДА ВТ_3.ФизЛицо_Терминал
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|	КОНЕЦ КАК ФизЛицо_Терминал,
		|	ВТ_3.Водитель.ФизЛицо КАК ФизЛицо_Водитель,
		|	ВТ_3.Экспедитор.ФизЛицо КАК ФизЛицо_Экспедитор,
		|	ВЫБОР
		|		КОГДА ВТ_3.Состояние_Принтер = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано)
		|			ТОГДА ВТ_3.ВремяВыдычи_Принтер
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВремяВыдачи_Принтер,
		|	ВЫБОР
		|		КОГДА ВТ_3.Состояние_Смартфон = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано)
		|			ТОГДА ВТ_3.ВремяВыдычи_Смартфон
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВремяВыдачи_Смартфон,
		|	ВЫБОР
		|		КОГДА ВТ_3.Состояние_Терминал = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано)
		|			ТОГДА ВТ_3.ВремяВыдычи_Терминал
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВремяВыдачи_Терминал,
		|	ВЫБОР
		|		КОГДА ВТ_3.Состояние_Принтер = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Сдано)
		|			ТОГДА ВТ_3.ВремяВыдычи_Принтер
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВремяСдачи_Принтер,
		|	ВЫБОР
		|		КОГДА ВТ_3.Состояние_Смартфон = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Сдано)
		|			ТОГДА ВТ_3.ВремяВыдычи_Смартфон
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВремяСдачи_Смартфон,
		|	ВЫБОР
		|		КОГДА ВТ_3.Состояние_Терминал = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Сдано)
		|			ТОГДА ВТ_3.ВремяВыдычи_Терминал
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВремяСдачи_Терминал
		|ИЗ
		|	ВТ_3 КАК ВТ_3";
	
	Запрос.УстановитьПараметр("ДатаРейса", НачалоДня(ДатаРейса));
	Запрос.УстановитьПараметр("ТерминалДоставки", ТерминалДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("МакетОтчета");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
	
	ТабДок.Вывести(ОбластьШапка);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ОбластьСтрока.Параметры.ТранспортНомерГосударственнойРегистрации = ВыборкаДетальныеЗаписи.Транспорт.НомерГосударственнойРегистрации;
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;

	Возврат ТабДок;
	
КонецФункции // ()
//CeHbKA #4417 13.01.2020
